# ColorIndexToRGBN

## Description
Procedure ColorIndexToRGBN converts the Vectorworks palette colors from the colors' palette position index to its red, green, and blue component values.

RGB values are in the range of 0~65535. (Black: (0, 0, 0), White: (65535, 65535, 65535))<br />
Parameter ignoreBlackBackground specifies whether the black background preference should be ignored.<br />
If set to TRUE, black and white indexes will not be inverted in black background.<br />

A color table listing with associated index values can be found in the #Color_Palette| Appendix]].

```pascal
PROCEDURE ColorIndexToRGBN(
				color                 : INTEGER;
				VAR red               : LONGINT;
				VAR green             : LONGINT;
				VAR blue              : LONGINT;
				ignoreBlackBackground : BOOLEAN);
```

```python
def vs.ColorIndexToRGBN(color, ignoreBlackBackground):
    return (red, green, blue)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|color|INTEGER|Color index|
|red|LONGINT|RGB color component value.|
|green|LONGINT|RGB color component value.|
|blue|LONGINT|RGB color component value.|
|ignoreBlackBackground|BOOLEAN|Ignore black background preference setting or not.|

## Examples
```pascal
ColorIndexToRGBN(255,r,g,b,TRUE);
{returns the color value components of the color index 255 (black 0, 0, 0)}
{Because ignoreBlackBackground is set to TRUE, the result }
{will always be black RGB color regardless of the black background }{preference setting.}
```

```pascal
GetColorChoice(dialog,kColorZero,ColorIdx);
ColorIndexToRGBN(ColorIdx,R,G,B,FALSE);
SetRField(parmHand,parmName,'__ZeroThresholdColor',Concat(R,',',G,',',B));

		bFlipTexture := GetLBItemInfo (dialog,kFrntMltColBrowser,RowCount,1,NewColorNameString,ImageItemIndex);
		TempColorNameArray[RowCount+1] := NewColorNameString;
	END;
GetColorChoice(dialog,kFrntMltColPanColPopUp,ColorChoiceNdx);
ColorIndexToRGBN(ColorChoiceNdx,NewRed,NewGreen,NewBlue,TRUE);		{16-bit}
```
```python
import vs

# Procedure ColorIndexToRGBN converts the Vectorworks palette colors from the
# colors' palette position index to its red, green, and blue component values.
color = 5
ignoreBlackBackground = True

red, green, blue = vs.ColorIndexToRGBN(color, ignoreBlackBackground)
vs.Message('ColorIndexToRGBN returned: ' + str((red, green, blue)))
```

## See Also
Functions:
* ColorIndexToRGB
* RGBToColorIndex
* RGBToColorIndexN
* GetPenFore | GetPenBack| GetFillFore | GetFillBack

## Version
Availability: from Vectorworks 2010

## Category
* Utility